app/Controllers/CategoryController.php

SELECT *
FROM `tbl_category`
---
    public function index()
    {
        $data['items'] = $this->category->findAll();

INSERT INTO `tbl_category` (`category_name`, `category_description`) VALUES ('Fresh', 'category/store')
---
    public function store(){
        $data = [
            'category_name' =>$this->request->getVar('cname'),
            'category_description' =>$this->request->getVar('description'),
        ];
        // print_r($data);
         $rules = [
            'cname' => 'required|max_length[30]|min_length[3]',
            'description' => 'required|max_length[150]|min_length[10]',
         ];

         if(! $this->validate($rules)){
            return redirect('category/create');
         } else {
            $this->category->insert($data);