app/Controllers/Customer.php

    public function index()
    {
        $data['items'] = $this->customer->findAll();
---
SELECT *
FROM `tbl_customer`