app/Controllers/Home.php

    public function index(): string
    {
        $data['totalbrand'] = $this->brand->countAllResults();
        $data['totalcategory'] = $this->category->countAllResults();
        $data['totalcustomer'] = $this->customer->countAllResults();
        $data['totalproduct'] = $this->product->countAllResults();
        $data['totalorder'] = $this->order->countAllResults();
        $data['totaluser'] = $this->user->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_brand`
SELECT COUNT(*) AS `numrows`
FROM `tbl_category`
SELECT COUNT(*) AS `numrows`
FROM `tbl_customer`
SELECT COUNT(*) AS `numrows`
FROM `tbl_product`
SELECT COUNT(*) AS `numrows`
FROM `tbl_order`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`