app/Controllers/Order.php

    public function index()
    {
        $data['orders'] = $this->order->findAll();
---
SELECT *
FROM `tbl_order`