app/Controllers/Products.php

SELECT *
FROM `tbl_product`
---
    public function index()
    {
        $data['items'] = $this->product->findAll();

SELECT *
FROM `tbl_category`
SELECT *
FROM `tbl_brand`
---
    public function entry()
    {
        $data['title'] = "Product Entry";

        $this->product->join('category_name','brand_name','category_id = tbl_product.category_id','brand_id = tbl_product.brand_id');
        $data['cats'] = $this->category->findAll();
        $data['bans'] = $this->brand->findAll();

INSERT INTO `tbl_product` (`product_title`, `product_short_description`, `product_long_description`, `product_price`, `product_quantity`, `product_category`, `product_brand`) VALUES ('meat', 'Contrary to popular belief, Lorem Ipsum is not simply random text. ', 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. Richard McClintock, a Latin professor at Hampden-Sydney College in Virginia', '650', '40kg', '10', '8')
---
    public function store(){

        $rules = [
            'pname' => 'required|max_length[30]',
            // 'pimg' => 'uploaded[pimg]|max_size[pimg,2048]|ext_in[photo,jpg,jpeg,png]',
        ];
        if (!$this->validate($rules)) {
            return redirect('product/entry');
        } else {
            $img = $this->request->getFile('pimg');
            $img_name = $img->getRandomName();
            $img->move('assets/uploads', $img_name);

            $data = [
                'product_title' =>$this->request->getVar("pname"),
                'product_short_description' =>$this->request->getVar("psd"),
                'product_long_description' =>$this->request->getVar("pld"),
                'product_price' =>$this->request->getVar("pprice"),
                'product_quantity' =>$this->request->getVar("pquantity"),
                'product_category' =>$this->request->getVar("cat"),
                'product_brand' =>$this->request->getVar("brand"),
                'product_image' => $img_name,
            ];
            //  print_r($data);
            $this->product->insert($data);