app/Controllers/SigninController.php

SELECT *
FROM `tbl_user`
WHERE `user_email` = 'alauddin@gmail.com'
 LIMIT 1
---
    public function login(){

        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $formpass = $this->request->getVar('pass');

        $data = $userModel->where('user_email', $email)->first();