app/Controllers/SignupController.php

INSERT INTO `tbl_user` (`user_name`, `user_email`, `user_role`, `user_password`) VALUES ('Shubho', 'shuv@gmail.com', 'Customer', '$2y$10$Ru1SEtzk0uJAh1gCrGiKbO/.O.In.Pnn7HiFAI0.NEs/hxB6TUfgS')
---
    public function store(){
    //     echo "Hello";
    //     $data = [
    //                     'user_name' => $this->request->getVar('name'),
    //                     'user_email' => $this->request->getVar('email'),
    //                     'user_password' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
    //     ];
    //     print_r($data);
    //    $user = new UserModel();
    //    $user->save($data);
        $rules = [
            'name'          => 'required|min_length[2]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[tbl_user.user_email]',
            'pass'          => 'required|min_length[4]|max_length[255]',
            'conpass'       => 'matches[pass]'
        ];

       if($this->validate($rules)){
            $data = [
                'user_name' => $this->request->getVar('name'),
                'user_email' => $this->request->getVar('email'),
                'user_role' => $this->request->getVar('role'),
                'user_password' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),


            ];
            print_r($data);
            $userModel = new UserModel();
            $userModel->save($data);